#include <iostream>
using namespace std;
int main()
{
    setlocale(0, "");

    int sum = 0, input;

    cout << "1. Как называется аниме про ниньзя который хотел стат хокаге?\n" <<
        "    1 - лучший в мире асасин переродился в другом мире    2 - берсерк    3 - наруто" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "2. как назывался фрукт который съел луфи из аниме ванпис?\n" <<
        "    1 - гому гому но ми    2 - Шершень    3 - Нуи Нуи но Ми " << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "3. кто создатель аниме тоторо ?\n" <<
        "    1 - Тацуми Кобаяши    2 - Хаяо Миядзаки    3 - Хокиро Токуми" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "4. какая студия создала аниме унесённые призраками?\n" <<
        "    1 - Bones    2 - TMS Entertainment    3 - Ghibli" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "5. какое аниме относится к жанру ужасы?\n" <<
        "    1 - о моём перерождении в слизь    2 - плод эволюции    3 - иная" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "6. как называлась техника наруто позволяющая ему создающая клонов?\n" <<
        "    1 - техника теневого клонирования    2 - расенган    3 - тысячилетие боли" << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "7. Как назывался имболансный щит  в аниме \"восхождение героя щита\"?\n" <<
        "    1 - пожератель душ    2 - щит природы    3 - щит гнева" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "8. как зовут гг в аниме Блю Лок?\n" <<
        "    1 -  кироми    2 -  I шикомару    3 - исаги" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "9. Кто из этих персонажей гг из аниме \"о моём перерождении в слизь\"?\n" <<
        "    1 - Джоуи    2 - ремуро    3 - саске" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "10. Сколько костей в теле человека?\n" <<
        "    1 - 209    2 - 206    3 - 201" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "11.  в каком аниме сказали точный химический состав человеческого тела??\n" <<
        "    1 - доктор стоун    2 - формоцвет    3 - стальной алхимик" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "12. сколько процентов луны было уничтоженно в аниме класс убийц?\n" <<
        "    1 - 70    2 - 1    3 - 59.999" << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "13. Какое из перечисленных аниме самое тдлинное ?\n" <<
        "    1 - ванпис    2 - атака титанов    3 - наруто" << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "14. как называют расенган с добовлением воздуха?\n" <<
        "    1 - расенган    2 - расен катана    3 - расен сурикен" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "15. как зовут гг в аниме ванпачмен?\n" <<
        "    1 - генос    2 - коджи    3 - сайтама" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "16. как звали персонажа с головой кабана в аниме клинок расекающий демонов?\n" <<
        "    1 - иноске    2 - сайто    3 - ичигаи" << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "17. как называется главное оружие самурая?\n" <<
        "    1 - нуньчаки    2 - катана    3 - шест" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "18. как называется аниме про лес грибов распространяющийся по миру и убивабщий ядовитыми спорами созданное Хаяо Миядзаки?\n" <<
        "    1 - ходящий замок хаула    2 - навсикая из жолины ветров    3 - ариэтти" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "19.  как звали отца сенко из аниме доктор стоун?\n" <<
        "    1 - сенко тибэо    2 - Исигами Бьякуя    3 - микиго наихимо" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "20. аниме в котором существо Х застовляет неверующего человека поверить в бога и не даёт ему шансов на перерождение посли смерти ?\n" <<
        "    1 - маг обманьщик из другово мира    2 - синий эгзорцист    3 - военные хроники маленькой девачки" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
}